fix: mermaid diagram fixed
